app/controllers/home_controller.rb

  def home
    @pages = Page.all
---
SELECT "pages".* FROM "pages"

  def chatroom
    @page = Page.find_by(id: params[:id])
    @posts = Post.where(page_id: params[:id]).order(created_at: :desc)
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."page_id" = ? ORDER BY "posts"."created_at" DESC  [["page_id", 2]]

  def newchat
    @page = Page.find_by(id: params[:page_id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @page = Page.find_by(id: params[:page_id])
    @post = Post.new(content: params[:content], page_id: @page.id )
    @post.save
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("content", "page_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "gyao"], ["page_id", 1], ["created_at", "2020-03-12 15:24:04.715270"], ["updated_at", "2020-03-12 15:24:04.715270"]]

  def createpage
    @page = Page.new(name: params[:name])
    @page.save
---
INSERT INTO "pages" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "あはは"], ["created_at", "2020-03-12 15:50:33.775637"], ["updated_at", "2020-03-12 15:50:33.775637"]]